# Data Preparation

> *The purpose of this step is to 'clean' the dataset. Thus, it will make further analyzes easier and remove possible problems from the dataset, such as incorrect or incomplete data.*

In [1]:
# Importing libraries.

import pandas as pd
import numpy as np

In [2]:
# Loading data from csv files.

microdata = pd.read_csv('database/MICRODADOS_ENEM_2021.csv', 
                        sep = ';', 
                        encoding='latin-1')

In [3]:
# Printing the size of the dataset.

print(f'The dataset has {microdata.shape[0]} rows and {microdata.shape[1]} columns')

The dataset has 3389832 rows and 76 columns

In [4]:
# Selecting the most interesting columns for the analysis.

interesting_columns = ['TP_FAIXA_ETARIA',
                       'TP_SEXO',
                       'TP_ESCOLA',
                       'NO_MUNICIPIO_PROVA',
                       'SG_UF_PROVA',
                       'NU_NOTA_CN',
                       'NU_NOTA_CH',
                       'NU_NOTA_LC',
                       'NU_NOTA_MT',
                       'NU_NOTA_REDACAO',
                       'Q006']

microdata = pd.DataFrame(microdata, 
                         columns = interesting_columns)

In [5]:
# Printing the new size of the dataset.

print(f'The database has {microdata.shape[0]} rows and {microdata.shape[1]} columns')

The database has 3389832 rows and 11 columns

In [6]:
# Printing the five first rows of the dataset.

microdata.head(5)

,TP_FAIXA_ETARIA,TP_SEXO,TP_ESCOLA,NO_MUNICIPIO_PROVA,SG_UF_PROVA,NU_NOTA_CN,NU_NOTA_CH,NU_NOTA_LC,NU_NOTA_MT,NU_NOTA_REDACAO,Q006
0,5,F,1,Nova Lima,MG,NaN,574.6,472.6,NaN,760.0,D
1,12,M,1,Macei贸,AL,505.9,551.8,498.3,461.5,560.0,B
2,13,F,1,Ferraz de Vasconcelos,SP,NaN,NaN,NaN,NaN,NaN,C
3,3,M,2,Crato,CE,580.7,678.9,638.9,659.5,780.0,B
4,2,F,2,Acarape,CE,497.7,532.4,457.6,582.6,780.0,C

In [7]:
# Looking for null values.

microdata.isnull().sum()

TP_FAIXA_ETARIA             0
TP_SEXO                     0
TP_ESCOLA                   0
NO_MUNICIPIO_PROVA          0
SG_UF_PROVA                 0
NU_NOTA_CN            1143988
NU_NOTA_CH            1011453
NU_NOTA_LC            1011453
NU_NOTA_MT            1143988
NU_NOTA_REDACAO       1011453
Q006                        2
dtype: int64

In [8]:
# Looking for grades with "0" score.

microdata['NU_NOTA_CN'].replace(0, np.nan, inplace = True)
microdata['NU_NOTA_CH'].replace(0, np.nan, inplace = True)
microdata['NU_NOTA_LC'].replace(0, np.nan, inplace = True)
microdata['NU_NOTA_MT'].replace(0, np.nan, inplace = True)
microdata['NU_NOTA_REDACAO'].replace(0, np.nan, inplace = True)

In [9]:
# Removing null values.

microdata.dropna(axis = 0, 
                 inplace = True)

In [10]:
# Looking for null values again.

microdata.isnull().sum()

TP_FAIXA_ETARIA       0
TP_SEXO               0
TP_ESCOLA             0
NO_MUNICIPIO_PROVA    0
SG_UF_PROVA           0
NU_NOTA_CN            0
NU_NOTA_CH            0
NU_NOTA_LC            0
NU_NOTA_MT            0
NU_NOTA_REDACAO       0
Q006                  0
dtype: int64

In [11]:
# Reseting the index of the dataset.

microdata.reset_index(inplace = True, 
                      drop = True)

In [12]:
# Replacing coded values in the 'age' column.

microdata.replace({'TP_FAIXA_ETARIA': {1: 'Under 20' ,
                                       2: 'Under 20',
                                       3: 'Under 20',
                                       4: 'Under 20',
                                       5: 'Between 20 and 30',
                                       6: 'Between 20 and 30',
                                       7: 'Between 20 and 30',
                                       8: 'Between 20 and 30',
                                       9: 'Between 20 and 30',
                                       10: 'Between 20 and 30',
                                       11: 'Between 20 and 30',
                                       12: 'Between 31 and 40',
                                       13: 'Between 31 and 40',
                                       14: 'Between 41 and 50',
                                       15: 'Between 41 and 50',
                                       16: 'Between 51 and 60',
                                       17: 'Between 51 and 60',
                                       18: 'Over 61',
                                       19: 'Over 61',
                                       20: 'Over 61'}}, 
                  inplace = True)

In [13]:
# Replacing coded values in the 'school' column.

microdata.replace({'TP_ESCOLA': {1: 'Did not answer',
                                  2: 'Public',
                                  3: 'Private'}},
                 inplace = True)

In [14]:
# Replacing coded values in the 'income' column.

microdata.replace({'Q006': {'A': 'No income',
                            'B': 'Up to 1 minimum wage',
                            'C': 'Between 1 and 5 minimum wages',
                            'D': 'Between 1 and 5 minimum wages',
                            'E': 'Between 1 and 5 minimum wages',
                            'F': 'Between 1 and 5 minimum wages',
                            'G': 'Between 1 and 5 minimum wages',
                            'H': 'Between 1 and 5 minimum wages',
                            'I': 'Between 6 and 10 minimum wages',
                            'J': 'Between 6 and 10 minimum wages',
                            'K': 'Between 6 and 10 minimum wages',
                            'L': 'Between 6 and 10 minimum wages',
                            'M': 'Between 6 and 10 minimum wages',
                            'N': 'Over 11 minimum wages',
                            'O': 'Over 11 minimum wages',
                            'P': 'Over 11 minimum wages',
                            'Q': 'Over 11 minimum wages'}},
                 inplace = True)

In [15]:
# Renaming the columns.

microdata.rename(columns={'TP_FAIXA_ETARIA': 'age',
                          'TP_SEXO': 'gender',
                          'TP_ESCOLA': 'school',
                          'NO_MUNICIPIO_PROVA': 'city',
                          'SG_UF_PROVA': 'state',
                          'NU_NOTA_CN': 'natural_sciences_grade',
                          'NU_NOTA_CH': 'human_sciences_grade',
                          'NU_NOTA_LC': 'languages_grade',
                          'NU_NOTA_MT': 'mathematics_grade',
                          'NU_NOTA_REDACAO': 'essay_grade',
                          'Q006': 'income'
                          },
                inplace = True)

In [16]:
# Verifying the columns types.

microdata.dtypes

age                        object
gender                     object
school                     object
city                       object
state                      object
natural_sciences_grade    float64
human_sciences_grade      float64
languages_grade           float64
mathematics_grade         float64
essay_grade               float64
income                     object
dtype: object

In [17]:
# Creating a new column for the final grade.

microdata['final_grade'] = (microdata['natural_sciences_grade'] + microdata['human_sciences_grade'] + microdata['languages_grade'] + microdata['mathematics_grade'] + microdata['essay_grade'])/5

In [18]:
# Printing the first rows of the final dataset.

microdata.head(5)

,age,gender,school,city,state,natural_sciences_grade,human_sciences_grade,languages_grade,mathematics_grade,essay_grade,income,final_grade
0,Between 31 and 40,M,Did not answer,Macei贸,AL,505.9,551.8,498.3,461.5,560.0,Up to 1 minimum wage,515.50
1,Under 20,M,Public,Crato,CE,580.7,678.9,638.9,659.5,780.0,Up to 1 minimum wage,667.60
2,Under 20,F,Public,Acarape,CE,497.7,532.4,457.6,582.6,780.0,Between 1 and 5 minimum wages,570.06
3,Between 20 and 30,F,Public,Belo Horizonte,MG,487.4,476.5,450.7,493.4,520.0,Up to 1 minimum wage,485.60
4,Under 20,F,Public,Ruy Barbosa,BA,507.6,539.2,494.6,413.3,380.0,Up to 1 minimum wage,466.94

In [19]:
# Printing the final size of the dataset.

print(f'The database has {microdata.shape[0]} rows and {microdata.shape[1]} columns')

The database has 2173531 rows and 12 columns

In [20]:
# Creating a new csv with the clean dataset.

microdata.to_csv('database/MICRODADOS_ENEM_2021_v2.csv', sep = ';', encoding='latin-1')